#### Terraform Format and Style 🖌``
 #### Terraform Initialization 🤖``
 #### Terraform Validation 🤖``
 #### Terraform Plan 📖`success`
 <details><summary>Show Plan</summary>
 ```

 data.terraform_remote_state.vpc: Reading...
data.archive_file.lambda_archive: Reading...
data.archive_file.lambda_archive: Read complete after 0s [id=88a5b0f0992f48dffb67f30df84b46ec03a3c874]
aws_acm_certificate.root_domain: Refreshing state... [id=arn:aws:acm:us-east-1:753493924839:certificate/dfaad735-a2b5-48d5-b22e-caf0399e16ff]
data.aws_route53_zone.domain: Reading...
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda-live-exec-role]
data.aws_iam_policy.aws_xray_write_only_access: Reading...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:eu-west-2:753493924839:certificate/5b489cc0-518c-4cd2-a73d-37ada439fa31]
aws_apigatewayv2_api.lambda: Refreshing state... [id=gm3vfqfo59]
data.aws_iam_policy.aws_xray_write_only_access: Read complete after 1s [id=arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/now-playing-gw-live]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-live-exec-role-20240324153431816400000001]
aws_iam_role_policy_attachment.aws_xray_write_only_access: Refreshing state... [id=serverless_lambda-live-exec-role-20240324203955664500000001]
data.aws_route53_zone.domain: Read complete after 1s [id=Z0557002I9JT094NPN27]
aws_lambda_function.lambda: Refreshing state... [id=nowplaying-lambda-live]
aws_apigatewayv2_domain_name.domain_name: Refreshing state... [id=nowplaying.lhowsam.com]
data.terraform_remote_state.vpc: Read complete after 1s
aws_apigatewayv2_stage.lambda: Refreshing state... [id=live]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/nowplaying-lambda-live]
aws_apigatewayv2_integration.lambda: Refreshing state... [id=bqr8n7e]
aws_apigatewayv2_route.lambda_route_now_playing: Refreshing state... [id=6rih7k1]
aws_apigatewayv2_route.lambda_route_health: Refreshing state... [id=y5p45e5]
aws_apigatewayv2_route.lambda_route_version: Refreshing state... [id=rofc13u]
aws_apigatewayv2_route.lambda_route_health_head: Refreshing state... [id=qn3sb6d]
aws_apigatewayv2_api_mapping.lambda: Refreshing state... [id=bdgj0r]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be updated in-place
  ~ resource "aws_acm_certificate" "cert" {
      ~ certificate_body          = <<-EOT
            <<-EOT
            -----BEGIN CERTIFICATE-----
          - MIIEnjCCA4agAwIBAgIUR+DwpHktym7pWZ8UwAHnINBVrjEwDQYJKoZIhvcNAQEL
          + MIIEpjCCA46gAwIBAgIUQcJsRhMU0YKLEciBEtF7JDcvkbMwDQYJKoZIhvcNAQEL
            BQAwgYsxCzAJBgNVBAYTAlVTMRkwFwYDVQQKExBDbG91ZEZsYXJlLCBJbmMuMTQw
            MgYDVQQLEytDbG91ZEZsYXJlIE9yaWdpbiBTU0wgQ2VydGlmaWNhdGUgQXV0aG9y
            aXR5MRYwFAYDVQQHEw1TYW4gRnJhbmNpc2NvMRMwEQYDVQQIEwpDYWxpZm9ybmlh
          - MB4XDTI0MDMyMjEzNDIwMFoXDTI2MDMyMjEzNDIwMFowYjEZMBcGA1UEChMQQ2xv
          + MB4XDTI0MDMyOTE5MDYwMFoXDTI2MDMyOTE5MDYwMFowYjEZMBcGA1UEChMQQ2xv
            dWRGbGFyZSwgSW5jLjEdMBsGA1UECxMUQ2xvdWRGbGFyZSBPcmlnaW4gQ0ExJjAk
            BgNVBAMTHUNsb3VkRmxhcmUgT3JpZ2luIENlcnRpZmljYXRlMIIBIjANBgkqhkiG
          - 9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuatyo4hBk1CiPf8NTPzYvrH0Ku1r7zXjLPjy
          - hSTyD7PH7Ow2KN0P3N73ZepnR5QEqItE4Pbdc1waBDO2g+blH+sDvsS8msiLACzz
          - eOOBC+baAvIavocPeArkbjU3lspLTu+uJ9JuoYlfPUJp6lgvLnwip0i4Xj31K3y1
          - qRk6mh5u+LNx6ndHZzExT3hc8AS3lGrQcqM8l8iWK6MmHZEpaoV9Kmdf+hfdITkY
          - 8K+ZVSwT+Gn7OMgQdRymr8/qtvyMl6BeIpisvzrkkHadkELyCJmFo5m7U6eu9u44
          - PyRstPsPq5nBbHbfI+ZxHL+SnnFeSs/h+Qk9t3aziEgd6qo5dwIDAQABo4IBIDCC
          - ARwwDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMCBggrBgEFBQcD
          - ATAMBgNVHRMBAf8EAjAAMB0GA1UdDgQWBBSoxehlsETfu9JuB3r4j/RBSTqBcDAf
          + 9w0BAQEFAAOCAQ8AMIIBCgKCAQEAkN4LiFPn0bMdKapTz/reD3YPsfZXtF7oh+Dx
          + MdXKR5iccyVFny6cPgyJ4pLV1eBAU/UiB8ZgDWidUj29aKx/LvPenaB/RukEjFc1
          + 5zrnbaDTMjCmGQKVYRkSsdRCDkDjyiQAj4zwzhbEM1MpmBCam7TpYaBso6rTB6zz
          + UrdBWHm4KLXLIa2PWz0OejOOyZ6Sky21j46hjwz/S50OIDEBiS5SEudDsCiqq7p5
          + 4YclbMYFXVKE3eyO/uFjYLkqkh/CZ1w9lvjK+xz+FFrVNuVqSW4pCb6SLysABvOr
          + DJ5/1/qKWBmJWV2UN6xX+A2z0daMPy/ZOYRG8frncneEVlEkgwIDAQABo4IBKDCC
          + ASQwDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMCBggrBgEFBQcD
          + ATAMBgNVHRMBAf8EAjAAMB0GA1UdDgQWBBRgZwfo/8KXrKznkMYBo+Fa1lH14zAf
            BgNVHSMEGDAWgBQk6FNXXXw0QIep65TbuuEWePwppDBABggrBgEFBQcBAQQ0MDIw
            MAYIKwYBBQUHMAGGJGh0dHA6Ly9vY3NwLmNsb3VkZmxhcmUuY29tL29yaWdpbl9j
          - YTAhBgNVHREEGjAYghZub3dwbGF5aW5nLmxob3dzYW0uY29tMDgGA1UdHwQxMC8w
          - LaAroCmGJ2h0dHA6Ly9jcmwuY2xvdWRmbGFyZS5jb20vb3JpZ2luX2NhLmNybDAN
          - BgkqhkiG9w0BAQsFAAOCAQEAEh3NnxNXyaKh/iLJW9YrdhX9lMIWTKZUJF+VS4ED
          - IC6iiX8h9PRY+1uI+gFozgg0A9ot9MlSx+H0NDQTVyB80abbHMzef1bJWKGkQ24R
          - U7uxJ0QdIZRyDVdxaycg0m1HYCZw9IoTf4wK4MT3235T47lPyqc75pam8CGGkE6o
          - 2rJ0McALHTEmj/7BXjPLdBrl2Yh77KCqwYHzc+KiuDLfuNTXndyjoLgGHdlEZz9S
          - NGCZpsuX1pCh2V5RqBcL3fHCRAFj6CGM1GNdeP/wur7utJq4wmA9U8mN+bi6TnJu
          - uj4OPRxcUt+S5wXhbsHFPukzu/5oFXkom26dNpsdEhRtLQ==
          + YTApBgNVHREEIjAggh5ub3dwbGF5aW5nLXN0YWdpbmcubGhvd3NhbS5jb20wOAYD
          + VR0fBDEwLzAtoCugKYYnaHR0cDovL2NybC5jbG91ZGZsYXJlLmNvbS9vcmlnaW5f
          + Y2EuY3JsMA0GCSqGSIb3DQEBCwUAA4IBAQAbR1AHX08x6dx16P9+RmDDWydZlhKf
          + qtghVLl+/r/aSkaFQSQuY3IBAXo2RndBti9ctHktRdpQnsPi5nVO62gpYZuG27hm
          + +nujeY1VyUPNFjZ4xBzpRyPgWEtWp4WULR4eBdvhxHecFhds1RoBPbjz98mXJvaP
          + 2HMIGtbqUY09m6qIk14B09F9WuM53f8VFPnOjLCYkeOMAvXKL4H6/+7aRRRVnVs6
          + 0KThJk7EfIGGUaM7mNMncoh3uzDJ/JBiGlwUFhwk+PZnXbK/W2o3hSK2vBjoEWLD
          + GXYGSS5OWwqQbiqajOM5pkzaxQTxW+iYHOCtuTwsTPCayDkc1y05oYzc
            -----END CERTIFICATE-----
            EOT
        EOT
        id                        = "arn:aws:acm:eu-west-2:753493924839:certificate/5b489cc0-518c-4cd2-a73d-37ada439fa31"
      ~ private_key               = (sensitive value)
      ~ tags                      = {
          ~ "Name"    = "Nowplaying certificate for live" -> "Nowplaying certificate for staging"
            "service" = "nowplaying"
          ~ "stage"   = "live" -> "staging"
        }
      ~ tags_all                  = {
          ~ "Name"    = "Nowplaying certificate for live" -> "Nowplaying certificate for staging"
          ~ "stage"   = "live" -> "staging"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate.root_domain must be replaced
+/- resource "aws_acm_certificate" "root_domain" {
      ~ arn                       = "arn:aws:acm:us-east-1:753493924839:certificate/dfaad735-a2b5-48d5-b22e-caf0399e16ff" -> (known after apply)
      ~ domain_name               = "nowplaying.lhowsam.com" -> "nowplaying-staging.lhowsam.com" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "nowplaying.lhowsam.com"
              - resource_record_name  = "_eb3ea3dd13a1dbb68e410060ab119f8b.nowplaying.lhowsam.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_66c54960fcea86ba36d0dbd86e6b3855.mhbtsbpdnt.acm-validations.aws."
            },
          + {
              + domain_name           = "nowplaying-staging.lhowsam.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:753493924839:certificate/dfaad735-a2b5-48d5-b22e-caf0399e16ff" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2025-04-22T23:59:59Z" -> (known after apply)
      ~ not_before                = "2024-03-24T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "INELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "nowplaying.lhowsam.com",
          + "nowplaying-staging.lhowsam.com",
        ]
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (1 unchanged attribute hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_apigatewayv2_api.lambda will be updated in-place
  ~ resource "aws_apigatewayv2_api" "lambda" {
        id                           = "gm3vfqfo59"
      ~ name                         = "now-playing-gw-live" -> "now-playing-gw-staging"
        tags                         = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_apigatewayv2_api_mapping.lambda must be replaced
-/+ resource "aws_apigatewayv2_api_mapping" "lambda" {
      ~ domain_name = "nowplaying.lhowsam.com" -> "nowplaying-staging.lhowsam.com" # forces replacement
      ~ id          = "bdgj0r" -> (known after apply)
      ~ stage       = "live" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_apigatewayv2_domain_name.domain_name must be replaced
-/+ resource "aws_apigatewayv2_domain_name" "domain_name" {
      ~ api_mapping_selection_expression = "$request.basepath" -> (known after apply)
      ~ arn                              = "arn:aws:apigateway:eu-west-2::/domainnames/nowplaying.lhowsam.com" -> (known after apply)
      ~ domain_name                      = "nowplaying.lhowsam.com" -> "nowplaying-staging.lhowsam.com" # forces replacement
      ~ id                               = "nowplaying.lhowsam.com" -> (known after apply)
      - tags                             = {} -> null
      ~ tags_all                         = {} -> (known after apply)

      ~ domain_name_configuration {
          ~ hosted_zone_id                         = "ZJ5UAJN8Y3Z2Q" -> (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          ~ target_domain_name                     = "d-fkf925fmra.execute-api.eu-west-2.amazonaws.com" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_apigatewayv2_integration.lambda will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "lambda" {
        id                     = "bqr8n7e"
      ~ integration_uri        = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:753493924839:function:nowplaying-lambda-live/invocations" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_apigatewayv2_stage.lambda must be replaced
-/+ resource "aws_apigatewayv2_stage" "lambda" {
      ~ arn             = "arn:aws:apigateway:eu-west-2::/apis/gm3vfqfo59/stages/live" -> (known after apply)
      ~ deployment_id   = "o9eq4h" -> (known after apply)
      ~ execution_arn   = "arn:aws:execute-api:eu-west-2:753493924839:gm3vfqfo59/live" -> (known after apply)
      ~ id              = "live" -> (known after apply)
      ~ invoke_url      = "https://gm3vfqfo59.execute-api.eu-west-2.amazonaws.com/live" -> (known after apply)
      ~ name            = "live" -> "staging" # forces replacement
      - stage_variables = {} -> null
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_log_settings {
          ~ destination_arn = "arn:aws:logs:eu-west-2:753493924839:log-group:/aws/api_gw/now-playing-gw-live" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ default_route_settings {
          + logging_level            = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_group.api_gw must be replaced
-/+ resource "aws_cloudwatch_log_group" "api_gw" {
      ~ arn               = "arn:aws:logs:eu-west-2:753493924839:log-group:/aws/api_gw/now-playing-gw-live" -> (known after apply)
      ~ id                = "/aws/api_gw/now-playing-gw-live" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/api_gw/now-playing-gw-live" -> "/aws/api_gw/now-playing-gw-staging" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.lambda_logs must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda_logs" {
      ~ arn               = "arn:aws:logs:eu-west-2:753493924839:log-group:/aws/lambda/nowplaying-lambda-live" -> (known after apply)
      ~ id                = "/aws/lambda/nowplaying-lambda-live" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/nowplaying-lambda-live" -> "/aws/lambda/nowplaying-lambda-staging" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.lambda_exec must be replaced
-/+ resource "aws_iam_role" "lambda_exec" {
      ~ arn                   = "arn:aws:iam::753493924839:role/serverless_lambda-live-exec-role" -> (known after apply)
      ~ create_date           = "2024-03-24T15:34:31Z" -> (known after apply)
      ~ id                    = "serverless_lambda-live-exec-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "serverless_lambda-live-exec-role" -> "serverless_lambda-staging-exec-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA263543PTZ5ELMP63Q" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.aws_xray_write_only_access must be replaced
-/+ resource "aws_iam_role_policy_attachment" "aws_xray_write_only_access" {
      ~ id         = "serverless_lambda-live-exec-role-20240324203955664500000001" -> (known after apply)
      ~ role       = "serverless_lambda-live-exec-role" -> "serverless_lambda-staging-exec-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.lambda_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_policy" {
      ~ id         = "serverless_lambda-live-exec-role-20240324153431816400000001" -> (known after apply)
      ~ role       = "serverless_lambda-live-exec-role" -> "serverless_lambda-staging-exec-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.lambda must be replaced
-/+ resource "aws_lambda_function" "lambda" {
      ~ arn                            = "arn:aws:lambda:eu-west-2:753493924839:function:nowplaying-lambda-live" -> (known after apply)
      ~ description                    = "Now playing Lambda live" -> "Now playing Lambda staging"
      ~ function_name                  = "nowplaying-lambda-live" -> "nowplaying-lambda-staging" # forces replacement
      ~ id                             = "nowplaying-lambda-live" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:753493924839:function:nowplaying-lambda-live/invocations" -> (known after apply)
      ~ last_modified                  = "2024-03-29T18:42:12.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:753493924839:function:nowplaying-lambda-live:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:753493924839:function:nowplaying-lambda-live:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::753493924839:role/serverless_lambda-live-exec-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "Tgd7Ezftrpub6WChoYGOhy5tJIPayi/AVtXfuXDkMDo=" -> "D83yNSlOQ7ETC4B8MJLRDyrwwP7Qx7V5YC2bN3eAv50="
      ~ source_code_size               = 91827 -> (known after apply)
      ~ tags                           = {
          ~ "Environment" = "live" -> "staging"
            "Service"     = "nowplaying"
        }
      ~ tags_all                       = {
          ~ "Environment" = "live" -> "staging"
            # (1 unchanged element hidden)
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (10 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format = "Text" -> null
          - log_group  = "/aws/lambda/nowplaying-lambda-live" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.api_gw must be replaced
-/+ resource "aws_lambda_permission" "api_gw" {
      ~ function_name       = "nowplaying-lambda-live" -> "nowplaying-lambda-staging" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 11 to add, 3 to change, 11 to destroy.

Changes to Outputs:
  ~ base_url      = "https://gm3vfqfo59.execute-api.eu-west-2.amazonaws.com/live" -> (known after apply)
  ~ function_name = "nowplaying-lambda-live" -> "nowplaying-lambda-staging"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

 ```
 </details>
  *Pushed by: @luke-h1, Action: `pull_request`*